aurutils-git
betterdiscord-installer
botan2
brother-mfc-j870dw
brscan4
carapace-bin
cemu-bin
clion
clion-cmake
clion-gdb
clion-lldb
downgrade
flatseal
gtk-engine-murrine
gtk2
http-parser
informant
kanagawa-gtk-theme-git
kanagawa-icon-theme-git
libiff-git
libilbm-git
libwireplumber-4.0-compat
localsend-bin
mattkavs-git
nmgui
nordvpn-bin
nuitka
oxker
paru
paru-debug
pwvucontrol
qimgv
qoi-headers-git
qtraw
rapidxml
sublime-text-4
tmux-sessionizer
yay
yay-debug
zen-browser-bin
zsh-fast-syntax-highlighting
