7zip
a2ps
a52dec
aalib
abseil-cpp
acl
adobe-source-sans-fonts
adwaita-cursors
adwaita-fonts
adwaita-icon-theme
adwaita-icon-theme-legacy
alsa-card-profiles
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
amd-ucode
android-tools
android-udev
aom
appstream
appstream-glib
aquamarine
arch-wiki-docs
archlinux-keyring
arduino-cli
arduino-language-server
argon2
ast-grep
at-spi2-core
atkmm
attica
attr
audacity
audiofile
audit
autoconf
automake
avahi
avisynthplus
ayatana-ido
babl
baloo
baloo-widgets
base
base-devel
bash
bash-completion
bat
binutils
bison
blas
blueman
bluez
bluez-libs
bluez-utils
boost-libs
botan
breeze-icons
breezy
brotli
btop
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cabextract
cairo
cairomm
cantarell-fonts
catch2
cblas
ccache
cdparanoia
cfitsio
chafa
chromium
cider
cifs-utils
clang
clucene
cmake
cmark
compiler-rt
composefs
containerd
convertlit
coreutils
cpio
cppdap
cryptsetup
cups
cups-filters
curl
dav1d
db5.3
dbus
dbus-broker
dbus-broker-units
dbus-glib
dbus-units
dconf
debugedit
debuginfod
default-cursors
desktop-file-utils
device-mapper
diffutils
ding-libs
discord
docbook-xml
docbook-xsl
docker
docker-compose
dolphin
dosfstools
double-conversion
doxygen
duf
duktape
dvisvgm
e2fsprogs
ebook-tools
efibootmgr
efivar
electron34
electron37
elfutils
enchant
ethtool
exfatprogs
exiv2
exo
expat
eza
faad2
fakeroot
fastfetch
ffcall
ffmpeg
ffmpeg4.4
ffmpegthumbnailer
fftw
file
filesystem
findutils
flac
flatpak
flatpak-builder
flex
fmt
font-manager
fontconfig
freeglut
freetype2
fribidi
fuse-common
fuse2
fuse3
fzf
gamescope
gawk
gc
gcc
gcc-libs
gcr
gcr-4
gd
gdb
gdb-common
gdbm
gdk-pixbuf2
gegl
gettext
ghostscript
ghostty
ghostty-shell-integration
ghostty-terminfo
gi-docgen
giflib
gimp
girara
git
git-zsh-completion
github-cli
gjs
glew
glib-networking
glib2
glib2-devel
glib2-docs
glibc
glibmm
glslang
glu
glycin
gmp
gnome-desktop
gnome-desktop-4
gnome-desktop-common
gnome-keyring
gnome-themes-extra
gnome-tweaks
gnulib-l10n
gnupg
gnutls
go
go-tools
gobject-introspection
gobject-introspection-runtime
gopls
gperftools
gpgme
gpgmepp
gpm
gpsd
graphene
graphite
graphviz
grep
grim
groff
grub
gsettings-desktop-schemas
gsettings-system-schemas
gsfonts
gsm
gssdp
gssproxy
gst-plugins-bad-libs
gst-plugins-base
gst-plugins-base-libs
gstreamer
gtest
gtk-doc
gtk-layer-shell
gtk-update-icon-cache
gtk3
gtk4
gtk4-layer-shell
gtkmm3
gts
guile
gumbo-parser
gupnp
gupnp-igd
gvfs
gzip
harfbuzz
harfbuzz-icu
help2man
hicolor-icon-theme
hidapi
highway
hiredis
hunspell
hunspell-en_us
hwdata
hwloc
hyphen
hyprcursor
hyprgraphics
hypridle
hyprland
hyprland-guiutils
hyprland-protocols
hyprland-qt-support
hyprlang
hyprlock
hyprpaper
hyprpolkitagent
hyprtoolkit
hyprutils
hyprwayland-scanner
iana-etc
icu
ijs
imagemagick
imath
iniparser
intltool
iproute2
iptables
iputils
iso-codes
jack2
jansson
jasper
java-environment-common
java-runtime-common
jbig2dec
jbigkit
jdk-openjdk
jq
js128
js140
json-c
json-glib
jsoncpp
karchive
kauth
kbd
kbookmarks
kcmutils
kcodecs
kcolorscheme
kcompletion
kconfig
kconfigwidgets
kcoreaddons
kcrash
kdbusaddons
kdnssd
kdsoap-qt6
kdsoap-ws-discovery-client
keyutils
kfilemetadata
kglobalaccel
kguiaddons
ki18n
kiconthemes
kidletime
kimageformats
kio
kio-extras
kirigami
kitemviews
kitty
kitty-shell-integration
kitty-terminfo
kjobwidgets
kmod
knewstuff
knotifications
kpackage
kparts
krb5
kservice
ktextwidgets
kuserfeedback
kvantum
kvantum-qt5
kwallet
kwidgetsaddons
kwindowsystem
kxmlgui
l-smash
ladspa
lame
lapack
lazygit
lcms2
ldb
leancrypto
lensfun
leptonica
less
lib32-alsa-lib
lib32-alsa-plugins
lib32-audit
lib32-brotli
lib32-bzip2
lib32-curl
lib32-dbus
lib32-e2fsprogs
lib32-expat
lib32-fontconfig
lib32-freetype2
lib32-gcc-libs
lib32-glib2
lib32-glibc
lib32-glu
lib32-gmp
lib32-gnutls
lib32-harfbuzz
lib32-icu
lib32-json-c
lib32-keyutils
lib32-krb5
lib32-libcap
lib32-libdisplay-info
lib32-libdrm
lib32-libelf
lib32-libffi
lib32-libgcrypt
lib32-libglvnd
lib32-libgpg-error
lib32-libidn2
lib32-libldap
lib32-libnghttp2
lib32-libnghttp3
lib32-libnm
lib32-libnsl
lib32-libpciaccess
lib32-libpipewire
lib32-libpng
lib32-libpsl
lib32-libssh2
lib32-libtasn1
lib32-libtirpc
lib32-libunistring
lib32-libva
lib32-libx11
lib32-libxau
lib32-libxcb
lib32-libxcrypt
lib32-libxcrypt-compat
lib32-libxdmcp
lib32-libxext
lib32-libxfixes
lib32-libxinerama
lib32-libxml2
lib32-libxrandr
lib32-libxrender
lib32-libxshmfence
lib32-libxss
lib32-libxxf86vm
lib32-llvm-libs
lib32-lm_sensors
lib32-mesa
lib32-ncurses
lib32-nettle
lib32-nspr
lib32-nss
lib32-openal
lib32-openssl
lib32-p11-kit
lib32-pam
lib32-pcre2
lib32-pipewire
lib32-spirv-tools
lib32-sqlite
lib32-systemd
lib32-util-linux
lib32-vkd3d
lib32-vulkan-icd-loader
lib32-vulkan-mesa-implicit-layers
lib32-vulkan-mesa-layers
lib32-vulkan-radeon
lib32-wayland
lib32-xcb-util-keysyms
lib32-xz
lib32-zlib
lib32-zstd
libabw
libadwaita
libarchive
libass
libassuan
libasyncns
libatasmart
libatomic_ops
libavc1394
libavif
libayatana-appindicator
libayatana-indicator
libb2
libblake3
libblockdev
libblockdev-crypto
libblockdev-fs
libblockdev-loop
libblockdev-mdraid
libblockdev-nvme
libblockdev-part
libblockdev-smart
libblockdev-swap
libbluray
libbpf
libbs2b
libbsd
libbytesize
libcanberra
libcap
libcap-ng
libcdio
libcdio-paranoia
libcdr
libcloudproviders
libcmis
libcolord
libcups
libcupsfilters
libdaemon
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdc1394
libde265
libdecor
libdeflate
libdisplay-info
libdovi
libdrm
libdvdnav
libdvdread
libe-book
libebml
libebur128
libedit
libei
libelf
libepoxy
libepubgen
libetonyek
libevdev
libevent
libexif
libexttextcat
libfdk-aac
libffi
libfontenc
libfreeaptx
libfreehand
libfyaml
libgcrypt
libgexiv2
libgirepository
libgit2
libglvnd
libgpg-error
libgphoto2
libgsf
libgtop
libgudev
libhandy
libheif
libice
libid3tag
libidn
libidn2
libiec61883
libieee1284
libimagequant
libimobiledevice
libimobiledevice-glue
libinih
libinput
libisl
libixion
libjpeg-turbo
libjxl
libkexiv2
libksba
liblangtag
liblc3
libldac
libldap
libliftoff
liblqr
libluv
libmad
libmakepkg-dropins
libmalcontent
libmanette
libmatroska
libmd
libmediainfo
libmfx
libmicrohttpd
libmm-glib
libmms
libmng
libmnl
libmodplug
libmpc
libmpdclient
libmspack
libmspub
libmtp
libmupdf
libmwaw
libmypaint
libmysofa
libmythes
libndp
libnet
libnetfilter_conntrack
libnewt
libnfnetlink
libnftnl
libnghttp2
libnghttp3
libngtcp2
libnice
libnl
libnm
libnotify
libnsl
libnumbertext
libnvme
libodfgen
libogg
libopenmpt
liborcus
libp11-kit
libpagemaker
libpaper
libpcap
libpciaccess
libpgm
libpipeline
libpipewire
libplacebo
libplist
libpng
libppd
libproxy
libpsl
libpulse
libqxp
libraqm
libraw
libraw1394
libreoffice-fresh
librevenge
librsvg
librsync
libsamplerate
libsasl
libsass
libsbsms
libseccomp
libsecret
libshout
libsigc++
libsigsegv
libsixel
libsm
libsndfile
libsodium
libsoup3
libsoxr
libspiro
libspng
libssh
libssh2
libstaroffice
libstemmer
libsynctex
libsysprof-capture
libtasn1
libtatsu
libteam
libthai
libtheora
libtiff
libtirpc
libtommath
libtool
libunibreak
libunistring
libunwind
liburing
libusb
libusbmuxd
libutempter
libutf8proc
libuv
libva
libva-utils
libvdpau
libverto
libvisio
libvlc
libvorbis
libvpl
libvpx
libvterm
libwacom
libwbclient
libwebp
libwireplumber
libwmf
libwpd
libwps
libx11
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcrypt-compat
libxcursor
libxcvt
libxdamage
libxdmcp
libxext
libxfce4ui
libxfce4util
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxml2
libxml2-legacy
libxmlb
libxmu
libxpm
libxpresent
libxrandr
libxrender
libxres
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyaml
libyuv
libzen
libzip
libzmf
licenses
lilv
linux
linux-api-headers
linux-firmware
linux-firmware-amdgpu
linux-firmware-atheros
linux-firmware-broadcom
linux-firmware-cirrus
linux-firmware-intel
linux-firmware-mediatek
linux-firmware-nvidia
linux-firmware-other
linux-firmware-radeon
linux-firmware-realtek
linux-firmware-whence
lld
llhttp
llvm-libs
lm_sensors
lmdb
love
lpsolve
lsb-release
lsof
lua
lua51-lpeg
luajit
luarocks
lutris
lv2
lxappearance
lz4
lzo
m4
mailcap
make
mako
man-db
man-pages
mariadb-libs
md4c
mdadm
media-player-info
mediainfo
mesa
mesa-utils
meson
minizip
mkinitcpio
mkinitcpio-busybox
mkvtoolnix-cli
mobile-broadband-provider-info
mpdecimal
mpfr
mpg123
mpv
msgpack-c
mtdev
mujs
mypaint-brushes1
ncdu
ncurses
neon
neovim
net-snmp
net-tools
netpbm
nettle
networkmanager
nfs-utils
nfsidmap
nftables
ninja
node-gyp
nodejs
nodejs-nopt
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-extra
npm
npth
nspr
nss
ntp
nvm
nwg-look
obsidian
ocl-icd
onetbb
oniguruma
openal
openbsd-netcat
opencore-amr
opencv
openexr
openh264
openjpeg2
openssh
openssl
opus
opusfile
orc
os-prober
ostree
otf-font-awesome
otf-geist-mono-nerd
p11-kit
pacman
pacman-contrib
pacman-mirrorlist
pacutils
pam
pambase
pamixer
pango
pangomm
parallel
parted
patch
patchelf
pciutils
pcre
pcre2
pcsclite
perl
perl-clone
perl-common-sense
perl-encode-locale
perl-error
perl-file-listing
perl-html-parser
perl-html-tagset
perl-http-cookiejar
perl-http-cookies
perl-http-daemon
perl-http-date
perl-http-message
perl-http-negotiate
perl-io-html
perl-json
perl-json-xs
perl-libwww
perl-locale-gettext
perl-lwp-mediatypes
perl-mailtools
perl-net-http
perl-timedate
perl-try-tiny
perl-types-serialiser
perl-uri
perl-www-robotrules
perl-xml-parser
phonon-qt6
phonon-qt6-vlc
pinentry
pipewire
pipewire-alsa
pipewire-audio
pipewire-docs
pipewire-pulse
pipewire-session-manager
pixman
pkgconf
pkgfile
pkgstats
plasma-activities
platformio-core
playerctl
plocate
poco
polkit
polkit-qt6
poppler
poppler-data
poppler-glib
poppler-qt6
popt
portaudio
portmidi
portsmf
potrace
powertop
pps-tools
prismlauncher
procps-ng
protobuf
psmisc
psutils
pugixml
python
python-ajsonrpc
python-anyio
python-appdirs
python-argcomplete
python-asgiref
python-attrs
python-autocommand
python-babel
python-backports-zstd
python-beautifulsoup4
python-boto3
python-botocore
python-bottle
python-breathe
python-brotli
python-build
python-cachecontrol
python-cairo
python-cbor2
python-certifi
python-cffi
python-charset-normalizer
python-click
python-colorama
python-configobj
python-cryptography
python-dateutil
python-dbus
python-distlib
python-distro
python-docopt
python-docstring-to-markdown
python-docutils
python-dulwich
python-evdev
python-fastbencode
python-feedparser
python-filelock
python-gobject
python-h11
python-html2text
python-httptools
python-i3ipc
python-idna
python-ifaddr
python-imagesize
python-importlib-metadata
python-installer
python-jaraco.collections
python-jaraco.context
python-jaraco.functools
python-jaraco.text
python-jedi
python-jinja
python-jmespath
python-lockfile
python-lsp-jsonrpc
python-lsp-server
python-lxml
python-magic
python-mako
python-markdown
python-markupsafe
python-marshmallow
python-merge3
python-moddb
python-more-itertools
python-msgpack
python-ordered-set
python-packaging
python-parso
python-patiencediff
python-pefile
python-pillow
python-pip
python-pipx
python-platformdirs
python-pluggy
python-protobuf
python-psutil
python-puremagic
python-pycparser
python-pyelftools
python-pygments
python-pypdf
python-pyproject-hooks
python-pyserial
python-pytz
python-pyxdg
python-pyzstd
python-requests
python-roman-numerals-py
python-s3transfer
python-semantic-version
python-setuptools
python-sgmllib3k
python-six
python-smartypants
python-sniffio
python-snowballstemmer
python-soupsieve
python-sphinx
python-sphinx-alabaster-theme
python-sphinx_rtd_theme
python-sphinxcontrib-applehelp
python-sphinxcontrib-devhelp
python-sphinxcontrib-htmlhelp
python-sphinxcontrib-jquery
python-sphinxcontrib-jsmath
python-sphinxcontrib-qthelp
python-sphinxcontrib-serializinghtml
python-starlette
python-tabulate
python-tqdm
python-typing_extensions
python-typogrify
python-ujson
python-urllib3
python-userpath
python-uvloop
python-virtualenv
python-websockets
python-wheel
python-wsproto
python-xlib
python-xxhash
python-yaml
python-zeroconf
python-zipp
python-zstandard
qca-qt6
qpdf
qt5-base
qt5-declarative
qt5-imageformats
qt5-svg
qt5-tools
qt5-translations
qt5-wayland
qt5-x11extras
qt5ct
qt6-5compat
qt6-base
qt6-declarative
qt6-imageformats
qt6-multimedia
qt6-multimedia-ffmpeg
qt6-networkauth
qt6-shadertools
qt6-speech
qt6-svg
qt6-translations
qt6-wayland
qt6ct
quazip-qt6
raptor
rasqal
rav1e
re2
readline
redland
reflector
resvg
rhash
ripgrep
ripgrep-all
rofi
rpcbind
rpmextract
rsync
rtkit
rubberband
runc
rust
sane
sassc
sbc
scons
screen
sdbus-cpp
sdl2-compat
sdl3
seatd
sed
semver
serd
serpl
shaderc
shadow
shared-mime-info
simdjson
slang
slurp
smbclient
snappy
sndio
solid
sonnet
sord
sound-theme-freedesktop
soundtouch
source-highlight
spdlog
speex
speexdsp
spirv-tools
sqlite
sratom
srt
sshfs
sshs
starship
startup-notification
stb
steam
stow
strace
sudo
suil
suitesparse
svt-av1
sway
sway-contrib
syndication
syntax-highlighting
systemd
systemd-libs
systemd-sysvcompat
taglib
talloc
tar
tdb
tealdeer
terminus-font
tesseract
tesseract-data-afr
tesseract-data-osd
tevent
texinfo
texlive-basic
texlive-bibtexextra
texlive-bin
texlive-binextra
texlive-context
texlive-fontsextra
texlive-fontsrecommended
texlive-fontutils
texlive-formatsextra
texlive-games
texlive-humanities
texlive-latex
texlive-latexextra
texlive-latexrecommended
texlive-luatex
texlive-mathscience
texlive-metapost
texlive-music
texlive-pictures
texlive-plaingeneric
texlive-pstricks
texlive-publishers
texlive-xetex
thunar
thunderbird
tinysparql
tinyxml2
tmux
tomlplusplus
tpm2-tss
tree-sitter
tree-sitter-bash
tree-sitter-c
tree-sitter-cli
tree-sitter-lua
tree-sitter-markdown
tree-sitter-query
tree-sitter-vim
tree-sitter-vimdoc
tslib
ttf-firacode-nerd
ttf-jetbrains-mono-nerd
ttf-liberation
ttf-nerd-fonts-symbols
ttf-nerd-fonts-symbols-common
ttf-noto-nerd
ttf-roboto
tumbler
twolame
tzdata
uchardet
udisks2
ufw
umu-launcher
unibilium
unixodbc
unrar
unzip
upower
usbutils
util-linux
util-linux-libs
uv
uvicorn
uwsm
v4l-utils
vala
valgrind
vamp-plugin-sdk
vapoursynth
verdict
vid.stab
vim
vim-runtime
vkd3d
vlc
vlc-cli
vlc-gui-qt
vlc-plugin-a52dec
vlc-plugin-alsa
vlc-plugin-archive
vlc-plugin-dav1d
vlc-plugin-dbus
vlc-plugin-dbus-screensaver
vlc-plugin-faad2
vlc-plugin-flac
vlc-plugin-gnutls
vlc-plugin-inflate
vlc-plugin-journal
vlc-plugin-jpeg
vlc-plugin-lua
vlc-plugin-mpg123
vlc-plugin-ogg
vlc-plugin-opus
vlc-plugin-png
vlc-plugin-pulse
vlc-plugin-shout
vlc-plugin-speex
vlc-plugin-tag
vlc-plugin-theora
vlc-plugin-twolame
vlc-plugin-vorbis
vlc-plugin-vpx
vlc-plugin-xml
vlc-plugins-base
vlc-plugins-video-output
vmaf
volume_key
vulkan-icd-loader
vulkan-mesa-implicit-layers
vulkan-mesa-layers
vulkan-radeon
vulkan-tools
w3m
wavpack
waybar
wayland
wayland-protocols
webkit2gtk-4.1
webkitgtk-6.0
webrtc-audio-processing-1
wev
wget
which
whois
wikiman
wine
winetricks
wireplumber
wl-clipboard
wlroots0.19
woff2
woff2-font-awesome
wpa_supplicant
wxwidgets-common
wxwidgets-gtk3
x264
x265
xcb-imdkit
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-errors
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xcur2png
xdg-dbus-proxy
xdg-desktop-portal
xdg-desktop-portal-hyprland
xdg-desktop-portal-wlr
xdg-user-dirs
xdg-utils
xfconf
xkeyboard-config
xmlsec
xorg-fonts-encodings
xorg-server-common
xorg-setxkbmap
xorg-xkbcomp
xorg-xprop
xorg-xrandr
xorg-xset
xorg-xwayland
xorgproto
xvidcore
xxhash
xz
yarn
yazi
yt-dlp
yyjson
zathura
zathura-pdf-mupdf
zenity
zeromq
zimg
zip
zix
zlib
zlib-ng
zoxide
zsh
zstd
zxing-cpp
zziplib
